tutorials/multiphase/interFoam/laminar/wave/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom   mesh;

sourceCase      ".";

sourcePatches   (right);

flipNormals     false;

nLayers         25;

expansionRatio  1.09;

extrudeModel    linearNormal;

linearNormalCoeffs
{
    thickness       1500;
}

mergeFaces      false;


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
